"OK" = "OK";
"Back" = "Back";
"Done" = "Done";
"Sorry" = "Sorry";
"Cancel" = "Cancel";
"Setting" = "Setting";
"Photos" = "Photos";
"Videos" = "Videos";
"Preview" = "Preview";
"Full image" = "Full image";
"Processing..." = "Processing...";
"Synchronizing photos from iCloud" = "Synchronizing photos from iCloud";
"Can not use camera" = "Functionality missing";
"Can not choose both video and photo" = "Can not choose both video and photo";
"Can not choose both photo and GIF" = "Can not choose both photo and GIF";
"Select the video when in multi state, we will handle the video as a photo" = "Select the video when in multi state, we will handle the video as a photo";
"Can not jump to the privacy settings page, please go to the settings page by self, thank you" = "Can not jump to the privacy settings page, please go to the settings page by self, thank you";

"Select a maximum of %zd photos" = "Select a maximum of %zd photos";
"Select a minimum of %zd photos" = "Select a minimum of %zd photos";
"Allow %@ to access your album in \"Settings -> Privacy -> Photos\"" = "Allow %@ to access your album in \"Settings -> Privacy -> Photos\"";
"Please allow %@ to access your camera in \"Settings -> Privacy -> Camera\"" = "Please allow %@ to access your camera in \"Settings -> Privacy -> Camera\"";
"You haven't set the microphone permission to use the function properly" = "You haven't set the microphone permission to use the function properly";
"You haven't set the camera permission to use the function properly" = "You haven't set the camera permission to use the function properly";
"You haven't set the album permission to use the function properly" = "You haven't set the album permission to use the function properly";
"You haven't set the album permission to save the picture" = "You haven't set the album permission to save the picture";
"You haven't set the album permission to save the video" = "You haven't set the album permission to save the video";
"You haven't set the location permission to send location Infomation" = "You haven't set the location permission to send location Infomation";
"Do you wanna save video?" = "Do you wanna save video?";

"chatEnd" = "Dialogue end";
"staffOffline" = "Customer offline";
"chatFailCancel" = "Cancel";
"chatFailContent" = "Dialogue access failed, whether to retry?";
"chatFailRetry" = "Retry";
"chatFailTitle" = "Dialogue failed";
"endChat" = "End Chat";
"leaveWordTitle" = "Leave Message";
"noNetWork" = "network connect failed";
"staffNickName" = "Customer Service";
"waitingTitle" = "Waiting for access";
"success" = "Success";
"fail" = "Fail";
"error" = "Error";
"notFound" = "Not Found";
"resourceError" = "Resource Error";
"playError" = "Play Error";
"netError" = "Net Error";
"pageLoadingError" = "Page loading error";
"uploadError" = "Upload Error";
"overSize" = "Over Size";
"save" = "Save";
"Do you end this conversation?" = "Whether to end this conversation?    ";
"Do you wanna save picture?" = "Do you wanna save picture?";
"loading" = "Loading...";
"connecting..." = "Connecting...";
"connectingTitle" = "Connecting...";
"[pic]" = "[pic]";
"tip" = "Tip";
"not support" = "Not Support";
"full image" = "Full image";
"work order" = "Work order";
"emoji" = "[emoji]";
"newMsg" = "new message";
"no message" = "No message";
"no network is available" = "no network is availabl";
"connect error,please check" ="connect error, please check";
"message" = "Message";
"message(%ld)" = "Message(%ld)";
"Tap to take a photo, hold to record a video" = "Tap to take a photo, hold to record a video";
"Mic not enabled. Unable to record" = "Mic not enabled. Unable to record";
"upload log" = "Upload Log";
"failed, please try again" = "Failed, please try again";
"no logs available" = "No logs available";

//----> extral_permission_description
"echat_permission_camera" = "camera permission,";
"echat_permission_microphone" = "microphone permission,";
"echat_permission_album" = "album permission,";
"echat_permission_location" = "locaiton permission,";
"echat_permission_use_description" = "Permission Usage Instructions";
"echat_permission_map_description" = "The location permission is used for customer service dialogue process, locate the current phone location, select the location information to send to customer service, do not authorize the appeal rights, does not affect the use of other functions";
"echat_permission_media_description" = "The album permission is used for sending pictures, videos and saving pictures, videos and files to local during customer service conversations, without authorization to appeal and without affecting the use of other functions";
"echat_permission_record_description" = "The %@ is used for customer service conversation process, taking photos, recording video, recording audio and sending to customer service, not authorized to appeal permissions, does not affect the use of other functions";

